using Test

tests = [
    "拟合线性回归模型",
    "使用预测值输入预测线性回归模型的响应",
    "线性回归模型的方差分析",
    "线性回归模型的预测响应",
    "线性回归模型系数的线性假设检验",
    "线性模型的套索或弹性网正则化",
    "偏最小二乘回归",
    "模型中方差百分比",
    "创建虚拟变量",
    "带剩余输入的Durbin-Watson检验",
    "选择拟合的正则线性回归模型",
    "线性回归模型系数估计的置信区间",
    "估计多元线性回归系数",
    "估计测试样本均方误差",
    "预测未用于训练的观察结果的反应",
    "拟合线性混合效应模型",
    "多元线性回归拟合",
    "多项式曲线拟合",
    "多项式的置信区间",
    "使用ReliefF或RReliefF算法对预测因子的重要性进行排序",
]

println("Runing tests:")
for t in tests
    fp = "$(t).jl"
    println("* $fp ...")
    include(fp)
end
